#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```

terraform
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.karpenter.data.aws_caller_identity.current: Reading...
module.eks.data.aws_partition.current[0]: Reading...
module.external_secrets_irsa_role.data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0cf29260349d2b408]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks_admins_iam_group.data.aws_partition.current: Reading...
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Reading...
module.eks_admins_iam_group.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.karpenter.data.aws_region.current: Reading...
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
data.aws_availability_zones.available: Reading...
module.karpenter.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.karpenter.data.aws_iam_policy_document.controller_assume_role[0]: Read complete after 0s [id=819195744]
module.karpenter.data.aws_partition.current: Reading...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/cluster-dev/cluster]
module.karpenter.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.external_secrets_irsa_role.data.aws_iam_policy_document.external_secrets[0]: Reading...
module.external_secrets_irsa_role.data.aws_iam_policy_document.external_secrets[0]: Read complete after 0s [id=2831063531]
module.external_secrets_irsa_role.data.aws_region.current: Reading...
module.external_secrets_irsa_role.data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.external_secrets_irsa_role.data.aws_partition.current: Reading...
module.external_secrets_irsa_role.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
data.aws_region.current: Reading...
data.aws_region.current: Read complete after 0s [id=ap-south-1]
data.aws_iam_policy_document.aws_lbc: Reading...
data.aws_iam_policy_document.aws_lbc: Read complete after 0s [id=819195744]
module.eks.data.aws_caller_identity.current[0]: Reading...
module.external_secrets_irsa_role.data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role.this[0]: Refreshing state... [id=karpenter-eks-node-group-20250629012757803800000004]
module.karpenter.data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=cluster-dev-cluster-20250629012757768700000003]
module.eks.module.eks_managed_node_group["karpenter"].data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Reading...
module.karpenter.data.aws_iam_policy_document.node_assume_role[0]: Read complete after 0s [id=2560088296]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/cluster-dev-cluster-20250629012757820900000005]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=karpenter-eks-node-group-20250629012757803800000004-2025062901275831750000000e]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=karpenter-eks-node-group-20250629012757803800000004-2025062901275822600000000b]
module.eks.module.eks_managed_node_group["karpenter"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=karpenter-eks-node-group-20250629012757803800000004-2025062901275828790000000d]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=cluster-dev-cluster-20250629012757768700000003-20250629012758165400000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=cluster-dev-cluster-20250629012757768700000003-2025062901275823560000000c]
module.eks_admins_iam_group.data.aws_caller_identity.current[0]: Read complete after 1s [id=944101542130]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=cluster-dev-cluster-20250629012757768700000003-2025062901275820360000000a]
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Reading...
module.eks_admins_iam_group.data.aws_iam_policy_document.iam_self_management: Read complete after 0s [id=2639324505]
data.aws_caller_identity.current: Read complete after 1s [id=944101542130]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 1s [id=944101542130]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=944101542130]
module.eks.data.aws_iam_session_context.current[0]: Reading...
data.aws_availability_zones.available: Read complete after 1s [id=ap-south-1]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 1s [id=arn:aws:sts::944101542130:assumed-role/github-oidc-role/aws-github-oidc]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=1195798529]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=6c5994a1-5b2b-4c9a-b72e-25c33e5a6304]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/cluster-dev]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::944101542130:policy/cluster-dev-cluster-ClusterEncryption20250629012823871700000016]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-092ebcf778b47727c]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Reading...
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0a401f7db8f40374f]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0ef3794d2e9637838]
module.eks_admins_iam_role.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=1863738953]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0adec77eeae03accf]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e52213b76dbfa78c]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0b4a4d8f6dac27006]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0e8e0cc0c4bafeddb]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=cluster-dev-cluster-20250629012757768700000003-20250629012824179400000017]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-13159719]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-3354504494]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1247151670]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-1783540024]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-246663864]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-2882064289]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-2035205458]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-502265497]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3993609689]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-1664127593]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1530394501]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=cluster-dev]
module.eks.data.tls_certificate.this[0]: Reading...
module.eks.aws_ec2_tag.cluster_primary_security_group["Owner"]: Refreshing state... [id=sg-02394c6552bb460d2,Owner]
module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=cluster-dev:arn:aws:iam::944101542130:role/github-oidc-role]
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-06-29T01:37:01Z]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-02394c6552bb460d2,Environment]
module.eks.aws_ec2_tag.cluster_primary_security_group["terraform"]: Refreshing state... [id=sg-02394c6552bb460d2,terraform]
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-02394c6552bb460d2,Project]
module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.aws_eks_access_entry.this["example"]: Refreshing state... [id=cluster-dev:arn:aws:iam::944101542130:root]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Reading...
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks_managed_node_group["karpenter"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=34994475842358218]
module.eks.module.eks_managed_node_group["karpenter"].aws_launch_template.this[0]: Refreshing state... [id=lt-0229f38579c18827b]
module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"]: Read complete after 1s [id=eks-pod-identity-agent]
module.eks.aws_eks_access_policy_association.this["example_example"]: Refreshing state... [id=cluster-dev#arn:aws:iam::944101542130:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=cluster-dev#arn:aws:iam::944101542130:role/github-oidc-role#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.data.tls_certificate.this[0]: Read complete after 1s [id=2efe2bc0b862928b4aefe315c4a10c4ad5223ff5]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::944101542130:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/3407FB410624852181AC6A8828E6FDF3]
module.eks.module.eks_managed_node_group["karpenter"].aws_eks_node_group.this[0]: Refreshing state... [id=cluster-dev:karpenter-20250629013710054000000029]
module.external_secrets_irsa_role.data.aws_iam_policy_document.this[0]: Reading...
module.external_secrets_irsa_role.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3264917230]
data.aws_eks_cluster_auth.default: Reading...
data.aws_eks_cluster_auth.default: Read complete after 0s [id=cluster-dev]
module.karpenter.aws_iam_role.node[0]: Refreshing state... [id=Karpenter-cluster-dev-2025062901363397760000001c]
module.karpenter.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.ap-south-1.amazonaws.com/944101542130/Karpenter-cluster-dev]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=cluster-dev:coredns]
module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=cluster-dev:vpc-cni]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=cluster-dev:eks-pod-identity-agent]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=cluster-dev:kube-proxy]
kubectl_manifest.karpenter_node_class: Refreshing state... [id=/apis/karpenter.k8s.aws/v1beta1/ec2nodeclasses/default]
module.karpenter.data.aws_iam_policy_document.queue[0]: Reading...
module.karpenter.data.aws_iam_policy_document.queue[0]: Read complete after 0s [id=2789825699]
module.karpenter.data.aws_iam_policy_document.v1[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Reading...
module.karpenter.data.aws_iam_policy_document.v033[0]: Read complete after 0s [id=2408900261]
module.karpenter.data.aws_iam_policy_document.v1[0]: Read complete after 0s [id=3272255584]
module.karpenter.data.aws_iam_policy_document.controller[0]: Reading...
module.karpenter.data.aws_iam_policy_document.controller[0]: Read complete after 0s [id=3272255584]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_eks_access_entry.manager will be created
  + resource "aws_eks_access_entry" "manager" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "cluster-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = [
          + "my-admin",
        ]
      + modified_at       = (known after apply)
      + principal_arn     = (known after apply)
      + tags_all          = (known after apply)
      + type              = "STANDARD"
      + user_name         = (known after apply)
    }

  # aws_eks_pod_identity_association.aws_lbc will be created
  + resource "aws_eks_pod_identity_association" "aws_lbc" {
      + association_arn = (known after apply)
      + association_id  = (known after apply)
      + cluster_name    = "cluster-dev"
      + id              = (known after apply)
      + namespace       = "kube-system"
      + role_arn        = (known after apply)
      + service_account = "aws-load-balancer-controller"
      + tags_all        = {}
    }

  # aws_iam_policy.aws_lbc will be created
  + resource "aws_iam_policy" "aws_lbc" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AWSLoadBalancerController"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "iam:CreateServiceLinkedRole",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:DescribeAccountAttributes",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeTags",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeCoipPools",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeTrustStores",
                          + "elasticloadbalancing:DescribeListenerAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:AssociateWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "wafv2:GetWebACL",
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:AssociateWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:CreateProtection",
                          + "shield:DeleteProtection",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:CreateSecurityGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:CreateTags",
                          + "ec2:DeleteTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:AuthorizeSecurityGroupIngress",
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateLoadBalancer",
                          + "elasticloadbalancing:CreateTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:CreateListener",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:DeleteRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:AddTags",
                          + "elasticloadbalancing:RemoveTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.eks_admin will be created
  + resource "aws_iam_policy" "eks_admin" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonEKSAdminPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:PassedToService" = "eks.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.eks_assume_admin will be created
  + resource "aws_iam_policy" "eks_assume_admin" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "AmazonEKSAssumeAdminPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.external_secrets will be created
  + resource "aws_iam_policy" "external_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for External Secrets Operator"
      + id               = (known after apply)
      + name             = "external-secrets-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                          + "secretsmanager:ListSecretVersionIds",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role.aws_lbc will be created
  + resource "aws_iam_role" "aws_lbc" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-aws-lbc"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.eks_admin will be created
  + resource "aws_iam_role" "eks_admin" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::944101542130:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-eks-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.aws_lbc will be created
  + resource "aws_iam_role_policy_attachment" "aws_lbc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-aws-lbc"
    }

  # aws_iam_role_policy_attachment.eks_admin will be created
  + resource "aws_iam_role_policy_attachment" "eks_admin" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dev-eks-admin"
    }

  # aws_iam_user.manager will be created
  + resource "aws_iam_user" "manager" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "manager"
      + path          = "/"
      + tags_all      = (known after apply)
      + unique_id     = (known after apply)
    }

  # aws_iam_user_policy_attachment.manager will be created
  + resource "aws_iam_user_policy_attachment" "manager" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + user       = "manager"
    }

  # helm_release.updater will be created
  + resource "helm_release" "updater" {
      + atomic                     = false
      + chart                      = "argocd-image-updater"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "updater"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                ---
                image:
                  tag: "v0.12.2"
                
                metrics:
                  enabled: true
            EOT,
        ]
      + verify                     = false
      + version                    = "0.9.1"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.allow_assume_eks_admins_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy"
      + id               = (known after apply)
      + name             = "allow-assume-eks-admin-iam-role"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.allow_eks_access_iam_policy.aws_iam_policy.policy[0] will be created
  + resource "aws_iam_policy" "policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy"
      + id               = (known after apply)
      + name             = "allow-eks-access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeCluster",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.eks_admins_iam_group.aws_iam_group.this[0] will be created
  + resource "aws_iam_group" "this" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "eks-admin"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # module.eks_admins_iam_group.aws_iam_group_membership.this[0] will be created
  + resource "aws_iam_group_membership" "this" {
      + group = (known after apply)
      + id    = (known after apply)
      + name  = "eks-admin"
      + users = [
          + "user1",
        ]
    }

  # module.eks_admins_iam_group.aws_iam_group_policy_attachment.custom_arns[0] will be created
  + resource "aws_iam_group_policy_attachment" "custom_arns" {
      + group      = (known after apply)
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.eks_admins_iam_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS     = "arn:aws:iam::944101542130:root"
                          + Service = []
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eks-admin"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
        # (2 unchanged attributes hidden)

      + inline_policy (known after apply)
    }

  # module.eks_admins_iam_role.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eks-admin"
    }

  # module.external_secrets_irsa_role.aws_iam_policy.external_secrets[0] will be created
  + resource "aws_iam_policy" "external_secrets" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Provides permissions to for External Secrets to retrieve secrets from AWS SSM and AWS Secrets Manager"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "AmazonEKS_External_Secrets_Policy-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:DescribeParameters"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                          + "ssm:GetParameter",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:*:*:parameter/*"
                    },
                  + {
                      + Action   = "secretsmanager:ListSecrets"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:ListSecretVersionIds",
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:GetResourcePolicy",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                    },
                  + {
                      + Action   = "kms:Decrypt"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:*:key/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.external_secrets_irsa_role.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ap-south-1.amazonaws.com/id/3407FB410624852181AC6A8828E6FDF3:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ap-south-1.amazonaws.com/id/3407FB410624852181AC6A8828E6FDF3:sub" = "system:serviceaccount:default:external-secrets-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::944101542130:oidc-provider/oidc.eks.ap-south-1.amazonaws.com/id/3407FB410624852181AC6A8828E6FDF3"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "external-secrets-irsa"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.external_secrets_irsa_role.aws_iam_role_policy_attachment.external_secrets[0] will be created
  + resource "aws_iam_role_policy_attachment" "external_secrets" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-secrets-irsa"
    }

  # module.external_secrets_irsa_role.aws_iam_role_policy_attachment.this["policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "external-secrets-irsa"
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["health_event"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - AWS health event"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "AWS Health Event",
                ]
              + source      = [
                  + "aws.health",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterHealthEvent-"
      + tags           = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all       = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance rebalance recommendation"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance Rebalance Recommendation",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceRebalance-"
      + tags           = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all       = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 instance state-change notification"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Instance State-change Notification",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterInstanceStateChange-"
      + tags           = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all       = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_rule.this["spot_interrupt"] will be created
  + resource "aws_cloudwatch_event_rule" "this" {
      + arn            = (known after apply)
      + description    = "Karpenter interrupt - EC2 spot instance interruption warning"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail-type = [
                  + "EC2 Spot Instance Interruption Warning",
                ]
              + source      = [
                  + "aws.ec2",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = (known after apply)
      + name_prefix    = "KarpenterSpotInterrupt-"
      + tags           = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all       = {
          + "ClusterName" = "cluster-dev"
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.karpenter.aws_cloudwatch_event_target.this["health_event"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_rebalance"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["instance_state_change"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_cloudwatch_event_target.this["spot_interrupt"] will be created
  + resource "aws_cloudwatch_event_target" "this" {
      + arn            = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = (known after apply)
      + target_id      = "KarpenterInterruptionQueueTarget"
    }

  # module.karpenter.aws_eks_access_entry.node[0] will be created
  + resource "aws_eks_access_entry" "node" {
      + access_entry_arn  = (known after apply)
      + cluster_name      = "cluster-dev"
      + created_at        = (known after apply)
      + id                = (known after apply)
      + kubernetes_groups = (known after apply)
      + modified_at       = (known after apply)
      + principal_arn     = "arn:aws:iam::944101542130:role/Karpenter-cluster-dev-2025062901363397760000001c"
      + tags              = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + type              = "EC2_LINUX"
      + user_name         = (known after apply)
    }

  # module.karpenter.aws_eks_pod_identity_association.karpenter[0] will be created
  + resource "aws_eks_pod_identity_association" "karpenter" {
      + association_arn = (known after apply)
      + association_id  = (known after apply)
      + cluster_name    = "cluster-dev"
      + id              = (known after apply)
      + namespace       = "kube-system"
      + role_arn        = (known after apply)
      + service_account = "karpenter"
      + tags            = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all        = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.karpenter.aws_iam_policy.controller[0] will be created
  + resource "aws_iam_policy" "controller" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Karpenter controller IAM policy"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "KarpenterController-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:RunInstances",
                          + "ec2:CreateFleet",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ec2:ap-south-1::snapshot/*",
                          + "arn:aws:ec2:ap-south-1::image/*",
                          + "arn:aws:ec2:ap-south-1:*:subnet/*",
                          + "arn:aws:ec2:ap-south-1:*:security-group/*",
                          + "arn:aws:ec2:ap-south-1:*:capacity-reservation/*",
                        ]
                      + Sid      = "AllowScopedEC2InstanceAccessActions"
                    },
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/kubernetes.io/cluster/cluster-dev" = "owned"
                            }
                          + StringLike   = {
                              + "aws:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:ap-south-1:*:launch-template/*"
                      + Sid       = "AllowScopedEC2LaunchTemplateAccessActions"
                    },
                  + {
                      + Action    = [
                          + "ec2:RunInstances",
                          + "ec2:CreateLaunchTemplate",
                          + "ec2:CreateFleet",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"              = "cluster-dev"
                              + "aws:RequestTag/kubernetes.io/cluster/cluster-dev" = "owned"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:ap-south-1:*:volume/*",
                          + "arn:aws:ec2:ap-south-1:*:spot-instances-request/*",
                          + "arn:aws:ec2:ap-south-1:*:network-interface/*",
                          + "arn:aws:ec2:ap-south-1:*:launch-template/*",
                          + "arn:aws:ec2:ap-south-1:*:instance/*",
                          + "arn:aws:ec2:ap-south-1:*:fleet/*",
                        ]
                      + Sid       = "AllowScopedEC2InstanceActionsWithTags"
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"              = "cluster-dev"
                              + "aws:RequestTag/kubernetes.io/cluster/cluster-dev" = "owned"
                              + "ec2:CreateAction"                                 = [
                                  + "RunInstances",
                                  + "CreateFleet",
                                  + "CreateLaunchTemplate",
                                ]
                            }
                          + StringLike   = {
                              + "aws:RequestTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:ap-south-1:*:volume/*",
                          + "arn:aws:ec2:ap-south-1:*:spot-instances-request/*",
                          + "arn:aws:ec2:ap-south-1:*:network-interface/*",
                          + "arn:aws:ec2:ap-south-1:*:launch-template/*",
                          + "arn:aws:ec2:ap-south-1:*:instance/*",
                          + "arn:aws:ec2:ap-south-1:*:fleet/*",
                        ]
                      + Sid       = "AllowScopedResourceCreationTagging"
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + "ForAllValues:StringEquals" = {
                              + "aws:TagKeys" = [
                                  + "eks:eks-cluster-name",
                                  + "karpenter.sh/nodeclaim",
                                  + "Name",
                                ]
                            }
                          + StringEquals                = {
                              + "aws:ResourceTag/kubernetes.io/cluster/cluster-dev" = "owned"
                            }
                          + StringEqualsIfExists        = {
                              + "aws:RequestTag/eks:eks-cluster-name" = "cluster-dev"
                            }
                          + StringLike                  = {
                              + "aws:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:ap-south-1:*:instance/*"
                      + Sid       = "AllowScopedResourceTagging"
                    },
                  + {
                      + Action    = [
                          + "ec2:TerminateInstances",
                          + "ec2:DeleteLaunchTemplate",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/kubernetes.io/cluster/cluster-dev" = "owned"
                            }
                          + StringLike   = {
                              + "aws:ResourceTag/karpenter.sh/nodepool" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:ec2:ap-south-1:*:launch-template/*",
                          + "arn:aws:ec2:ap-south-1:*:instance/*",
                        ]
                      + Sid       = "AllowScopedDeletion"
                    },
                  + {
                      + Action    = [
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSpotPriceHistory",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeLaunchTemplates",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeInstanceTypeOfferings",
                          + "ec2:DescribeImages",
                          + "ec2:DescribeAvailabilityZones",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestedRegion" = "ap-south-1"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                      + Sid       = "AllowRegionalReadActions"
                    },
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-south-1::parameter/aws/service/*"
                      + Sid      = "AllowSSMReadActions"
                    },
                  + {
                      + Action   = "pricing:GetProducts"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowPricingReadActions"
                    },
                  + {
                      + Action   = [
                          + "sqs:ReceiveMessage",
                          + "sqs:GetQueueUrl",
                          + "sqs:DeleteMessage",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
                      + Sid      = "AllowInterruptionQueueActions"
                    },
                  + {
                      + Action    = "iam:PassRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:PassedToService" = "ec2.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::944101542130:role/Karpenter-cluster-dev-2025062901363397760000001c"
                      + Sid       = "AllowPassingInstanceRole"
                    },
                  + {
                      + Action    = "iam:CreateInstanceProfile"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"              = "cluster-dev"
                              + "aws:RequestTag/kubernetes.io/cluster/cluster-dev" = "owned"
                              + "aws:RequestTag/topology.kubernetes.io/region"     = "ap-south-1"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::944101542130:instance-profile/*"
                      + Sid       = "AllowScopedInstanceProfileCreationActions"
                    },
                  + {
                      + Action    = "iam:TagInstanceProfile"
                      + Condition = {
                          + StringEquals = {
                              + "aws:RequestTag/eks:eks-cluster-name"               = "cluster-dev"
                              + "aws:RequestTag/kubernetes.io/cluster/cluster-dev"  = "owned"
                              + "aws:RequestTag/topology.kubernetes.io/region"      = "ap-south-1"
                              + "aws:ResourceTag/kubernetes.io/cluster/cluster-dev" = "owned"
                              + "aws:ResourceTag/topology.kubernetes.io/region"     = "ap-south-1"
                            }
                          + StringLike   = {
                              + "aws:RequestTag/karpenter.k8s.aws/ec2nodeclass"  = "*"
                              + "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::944101542130:instance-profile/*"
                      + Sid       = "AllowScopedInstanceProfileTagActions"
                    },
                  + {
                      + Action    = [
                          + "iam:RemoveRoleFromInstanceProfile",
                          + "iam:DeleteInstanceProfile",
                          + "iam:AddRoleToInstanceProfile",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "aws:ResourceTag/kubernetes.io/cluster/cluster-dev" = "owned"
                              + "aws:ResourceTag/topology.kubernetes.io/region"     = "ap-south-1"
                            }
                          + StringLike   = {
                              + "aws:ResourceTag/karpenter.k8s.aws/ec2nodeclass" = "*"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:iam::944101542130:instance-profile/*"
                      + Sid       = "AllowScopedInstanceProfileActions"
                    },
                  + {
                      + Action   = "iam:GetInstanceProfile"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::944101542130:instance-profile/*"
                      + Sid      = "AllowInstanceProfileReadActions"
                    },
                  + {
                      + Action   = "eks:DescribeCluster"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:eks:ap-south-1:944101542130:cluster/cluster-dev"
                      + Sid      = "AllowAPIServerEndpointDiscovery"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.karpenter.aws_iam_role.controller[0] will be created
  + resource "aws_iam_role" "controller" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "pods.eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Karpenter controller IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "KarpenterController-"
      + path                  = "/"
      + tags                  = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "sandbox"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.controller[0] will be created
  + resource "aws_iam_role_policy_attachment" "controller" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "Karpenter-cluster-dev-2025062901363397760000001c"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "Karpenter-cluster-dev-2025062901363397760000001c"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node["AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "node" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "Karpenter-cluster-dev-2025062901363397760000001c"
    }

  # module.karpenter.aws_iam_role_policy_attachment.node_additional["AmazonSSMManagedInstanceCore"] will be created
  + resource "aws_iam_role_policy_attachment" "node_additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "Karpenter-cluster-dev-2025062901363397760000001c"
    }

  # module.karpenter.aws_sqs_queue_policy.this[0] will be created
  + resource "aws_sqs_queue_policy" "this" {
      + id        = (known after apply)
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sqs:SendMessage"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = [
                              + "sqs.amazonaws.com",
                              + "events.amazonaws.com",
                            ]
                        }
                      + Resource  = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
                      + Sid       = "SqsWrite"
                    },
                  + {
                      + Action    = "sqs:*"
                      + Condition = {
                          + StringEquals = {
                              + "aws:SecureTransport" = "false"
                            }
                        }
                      + Effect    = "Deny"
                      + Principal = "*"
                      + Resource  = "arn:aws:sqs:ap-south-1:944101542130:Karpenter-cluster-dev"
                      + Sid       = "DenyHTTP"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + queue_url = "https://sqs.ap-south-1.amazonaws.com/944101542130/Karpenter-cluster-dev"
    }

  # module.user1_iam_user.aws_iam_user.this[0] will be created
  + resource "aws_iam_user" "this" {
      + arn                  = (known after apply)
      + force_destroy        = true
      + id                   = (known after apply)
      + name                 = "user1"
      + path                 = "/"
      + tags_all             = (known after apply)
      + unique_id            = (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = "acl-00687fe166445451c"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + tags                   = {
          + "Environment" = "sandbox"
          + "Name"        = "main-default"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "sandbox"
          + "Name"        = "main-default"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = "rtb-0558fc19d75382525"
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + route                  = (known after apply)
      + tags                   = {
          + "Environment" = "sandbox"
          + "Name"        = "main-default"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "sandbox"
          + "Name"        = "main-default"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "sandbox"
          + "Name"        = "main-default"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "sandbox"
          + "Name"        = "main-default"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + vpc_id                 = "vpc-0cf29260349d2b408"
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Environment" = "sandbox"
          + "Name"        = "main-ap-south-1a"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all             = {
          + "Environment" = "sandbox"
          + "Name"        = "main-ap-south-1a"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + vpc                  = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0e52213b76dbfa78c"
      + tags                               = {
          + "Environment" = "sandbox"
          + "Name"        = "main-ap-south-1a"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "sandbox"
          + "Name"        = "main-ap-south-1a"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = "igw-0e8e0cc0c4bafeddb"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "sandbox"
          + "Name"        = "main-private"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "sandbox"
          + "Name"        = "main-private"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + vpc_id           = "vpc-0cf29260349d2b408"
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "sandbox"
          + "Name"        = "main-public"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "sandbox"
          + "Name"        = "main-public"
          + "Owner"       = "Durgaprasad"
          + "Project"     = "EKS-DNS-setup"
          + "terraform"   = "true"
        }
      + vpc_id           = "vpc-0cf29260349d2b408"
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0b4a4d8f6dac27006"
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0a401f7db8f40374f"
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0e52213b76dbfa78c"
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = "subnet-0adec77eeae03accf"
    }

Plan: 56 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + external_secrets_irsa_role_arn = (known after apply)

```

</details>

*Pusher: @durga61, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform AWS infra creation`*